{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Все сразу 1 🌶️\n",
    "Дополните приведенный код, чтобы он:\n",
    "\n",
    "Вывел длину списка;\n",
    "Вывел последний элемент списка;\n",
    "Вывел список в обратном порядке (вспоминаем срезы);\n",
    "Вывел YES если список содержит числа 5 и 17, и NO в противном случае;\n",
    "Вывел список с удаленным первым и последним элементами.\"\"\"\n",
    "\n",
    "numbers = [2, 6, 3, 14, 10, 4, 11, 16, 12, 5, 4, 16, 1, 0, 8, 16, 10, 10, 8, 5, 1, 11, 10, 10, 12, 0, 0, 6, 14, 8, 2, 12, 14, 5, 6, 12, 1, 2, 10, 14, 9, 1, 15, 1, 2, 14, 16, 6, 7, 5]\n",
    "print(len(numbers))\n",
    "print(numbers[-1])\n",
    "print(numbers[-1::-1])\n",
    "if '5' in numbers and '17' in numbers:\n",
    "    print('YES')\n",
    "else:\n",
    "    print('NO')\n",
    "del numbers[0] \n",
    "del numbers[-1]\n",
    "print(numbers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Список строк\n",
    "На вход программе подается натуральное число n, а затем nn строк. Напишите программу, которая создает из указанных строк список и выводит его.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются натуральное число n, а затем nn строк, каждая на отдельной строке.\"\"\"\n",
    "\n",
    "a = int(input())\n",
    "b = []\n",
    "for i in range(a):\n",
    "    b.append(input())\n",
    "print(b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Алфавит\n",
    "Напишите программу, выводящую следующий список:\n",
    "\n",
    "['a', 'bb', 'ccc', 'dddd', 'eeeee', 'ffffff', ...]\n",
    "Формат выходных данных\n",
    "Программа должна вывести указанный список.\"\"\"\n",
    "\n",
    "abc = 'abcdefghijklmnopqrstuvwxyz'\n",
    "a = []\n",
    "count = 0\n",
    "for i in abc:\n",
    "    count += 1\n",
    "    a.append(i * count)\n",
    "print(a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Список кубов\n",
    "На вход программе подается натуральное число n, а затем nn целых чисел. Напишите программу, которая создает из указанных чисел список их кубов.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке.\"\"\"\n",
    "\n",
    "b = int(input())\n",
    "a = []\n",
    "for i in range(b):\n",
    "    a.append(int(input()) ** 3 )\n",
    "print(a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Список делителей\n",
    "На вход программе подается натуральное число n. Напишите программу, которая создает список состоящий из делителей введенного числа.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается натуральное число n.\"\"\"\n",
    "\n",
    "b = int(input())\n",
    "a = []\n",
    "for i in range(1,b+1):\n",
    "    if b % i == 0:\n",
    "        a.append(i)\n",
    "print(a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Суммы двух\n",
    "На вход программе подается натуральное число n ≥ 2, а затем n целых чисел. Напишите программу, которая создает из указанных чисел список, состоящий из сумм соседних чисел (00 и 11, 11 и 22, 22 и 33 и т.д.).\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке.\"\"\"\n",
    "\n",
    "b = int(input())\n",
    "a = []\n",
    "for j in range(b):\n",
    "    a.append(int(input()))\n",
    "for i in range(len(a)-1):\n",
    "        a.append(a[0] + a[1])\n",
    "        del a[0]\n",
    "del a[0]\n",
    "print(a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Удалите нечетные индексы\n",
    "На вход программе подается натуральное число n, а затем n целых чисел. Напишите программу, которая создает из указанных чисел список, затем удаляет все элементы стоящие по нечетным индексам, а затем выводит полученный список.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке.\"\"\"\n",
    "\n",
    "b = int(input())\n",
    "a = []\n",
    "for j in range(b):\n",
    "    a.append(int(input()))\n",
    "del a[1::2]\n",
    "print(a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"k-ая буква слова 🌶️🌶️\n",
    "На вход программе подается натуральное число n и n строк, а затем число k. Напишите программу, которая выводит k-ую букву из введенных строк на одной строке без пробелов.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается натуральное число n,  далее n строк, каждая на отдельной строке. В конце вводится натуральное число k – номер буквы (нумерация начинается с единицы).\"\"\"\n",
    "\n",
    "b = int(input())\n",
    "a = []\n",
    "c = ''\n",
    "for j in range(b):\n",
    "    a.append(input())\n",
    "k = int(input())    \n",
    "for i in range(len(a)):\n",
    "    if len(a[i]) >= k:\n",
    "       c += (a[i] [k - 1])\n",
    "print(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Символы всех строк\n",
    "На вход программе подается натуральное число n, а затем n строк. Напишите программу, которая создает список из символов всех строк, а затем выводит его.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются натуральное число n, а затем n строк, каждая на отдельной строке.\"\"\"\n",
    "\n",
    "b = int(input())\n",
    "a = []\n",
    "for j in range(b):\n",
    "    a.extend(input())\n",
    "print(a)"
   ]
  }
 ]
}