{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Построчный вывод\n",
    "На вход программе подается строка текста. Напишите программу, которая выводит слова введенной строки в столбик.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста.\"\"\"\n",
    "\n",
    "s = input().split()\n",
    "print(*s, sep = '\\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Инициалы\n",
    "На вход программе подается строка текста, содержащая имя, отчество и фамилию человека. Напишите программу, которая выводит инициалы человека.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста, содержащая имя, отчество и фамилию человека.\"\"\"\n",
    "\n",
    "s = input().split()\n",
    "for i in s:\n",
    "    print(i[0], end ='.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Windows OS\n",
    "В операционной системе Windows полное имя файла состоит из буквы диска, после которого ставится двоеточие и символ  \"\\\",  затем через такой же символ перечисляются подкатологи (папки), в которых находится файл, в конце пишется имя файла (C:\\Windows\\System32\\calc.exe).\n",
    "\n",
    "На вход программе подается одна строка с корректным именем файла в операционной системе Windows. Напишите программу, которая разбирает строку на части, разделенные символом \"\\\". Каждую часть вывести в отдельной строке.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка.\"\"\"\n",
    "\n",
    "s = input().split('\\\\')\n",
    "print(*s, sep = '\\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Диаграмма\n",
    "На вход программе подается строка текста, содержащая целые числа. Напишите программу, которая по заданным числам строит столбчатую диаграмму.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста, содержащая целые числа, разделенных символом пробела.\"\"\"\n",
    "\n",
    "s = input().split()\n",
    "for i in s:\n",
    "    print('+' * int(i))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Корректный ip-адрес\n",
    "На вход программе подается строка текста, содержащая 4 целых числа разделенных точкой. Напишите программу, которая определяет является ли введенная строка текста корректным ip-адресом.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста, содержащая 4 целых числа разделенных точкой.\"\"\"\n",
    "\n",
    "s = input().split('.')\n",
    "count = 0\n",
    "for i in s:\n",
    "    if 0 <= int(i) <= 255:\n",
    "        count += 1 \n",
    "        if count == 4:\n",
    "            print('ДА')\n",
    "    else:\n",
    "        print('НЕТ')\n",
    "        break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Добавь разделитель\n",
    "На вход программе подается строка текста и строка разделитель. Напишите программу, которая вставляет указанный разделитель между каждым символом введенной строки текста.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста и строка разделитель, каждая на отдельной строке\"\"\"\n",
    "\n",
    "print(*list(input()), sep=input())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Количество совпадающих пар\n",
    "На вход программе подается строка текста, содержащая натуральные числа. Из данной строки формируется список чисел. Напишите программу, которая подсчитывает, сколько в полученном списке пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста, содержащая натуральные числа, отделенные символом пробела.\"\"\"\n",
    "\n",
    "s = input().split(' ')\n",
    "count = 0\n",
    "couple = 0\n",
    "for i in s:\n",
    "    for j in range(len(s)):\n",
    "        if i == s[j]:\n",
    "            count +=1\n",
    "            if count >=2:\n",
    "                couple +=1 \n",
    "                continue\n",
    "    count = 0\n",
    "print(int(couple/2))"
   ]
  }
 ]
}