{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Список четных\n",
    "На вход программе подается четное число ,n≥2. Напишите программу, которая выводит список четных чисел\n",
    "\n",
    " [2, 4, 6, ..., n].\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается четное натуральное число.\"\"\"\n",
    "\n",
    "list =[i for i in range(2, (int(input())+1), 2)]\n",
    "print(list)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Сумма двух списков\n",
    "На вход программе подаются две строки текста, содержащие целые числа. Из данных строк формируются списки чисел L и M. Напишите программу, которая создает третий список, элементами которого являются суммы соответствующих элементов списков L и M. Далее программа должна вывести каждый элемент полученного списка на одной строке через 1 символ пробел.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются две строка текста, содержащие целые числа, разделенные символом пробела.\"\"\"\n",
    "\n",
    "a, b = [int(x) for x in input().split()], [int(x) for x in input().split()]\n",
    "c = []\n",
    "for i in range(len(a)):\n",
    "    c.append(a[i] +b[i])\n",
    "print(*c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Сумма чисел\n",
    "На вход программе подается строка текста, содержащая натуральные числа. Напишите программу, которая вставляет между каждым числом знак +, а затем вычисляет сумму полученных чисел.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста, содержащая натуральные числа, разделенные символом пробела.\"\"\"\n",
    "\n",
    "a = input().split()\n",
    "b = '+'.join(a)\n",
    "print(b + '=' + str((sum(int(i) for i in a))))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Валидный номер 🌶️🌶️\n",
    "На вход программе подается строка текста. Напишите программу, которая определяет является ли введенная строка корректным телефонным номером. Строка текста является корректным телефонным номером если она имеет формат:\n",
    "\n",
    "abc-def-hijk или\n",
    "7-abc-def-hijk\n",
    "где a, b, c, d, e, f, h, i, j, k – цифры от 0 до 9.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается строка текста.\"\"\"\n",
    "\n",
    "a = input()\n",
    "cnt = 0\n",
    "if len(a) == 12 and a[3] == '-' and a[7] == '-':\n",
    "    for i in range(3):\n",
    "        if a[i] not in '1234567890':\n",
    "            cnt +=1\n",
    "    for i in range(4,7):\n",
    "        if a[i] not in '1234567890':\n",
    "            cnt +=1\n",
    "    for i in range(8,12):\n",
    "        if a[i] not in '1234567890':\n",
    "            cnt +=1\n",
    "    if cnt == 0:\n",
    "        print('YES')\n",
    "    else: \n",
    "        print('NO')\n",
    "elif len(a) == 14 and a[0] == '7' and a[1] == '-' and a[5] == '-' and a[9] == '-':\n",
    "    for i in range(2,5):\n",
    "        if a[i] not in '1234567890':\n",
    "            cnt +=1\n",
    "    for i in range(6,9):\n",
    "        if a[i] not in '1234567890':\n",
    "            cnt +=1\n",
    "    for i in range(10,14):\n",
    "        if a[i] not in '1234567890':\n",
    "            cnt +=1\n",
    "    if cnt == 0:\n",
    "        print('YES')\n",
    "    else: \n",
    "        print('NO')\n",
    "else:\n",
    "    print('NO')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Самый длинный\n",
    "На вход программе подается строка текста. Напишите программу, использующую списочное выражение, которая находит длину самого длинного слова.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста.\"\"\"\n",
    "\n",
    "a = [i for i in input().split()]\n",
    "for i in range(len(a)):\n",
    "    a[i] = len(a[i])\n",
    "print(max(a))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Молодежный жаргон\n",
    "На вход программе подается строка текста. Напишите программу, использующую списочное выражение, которая преобразует каждое слово введенного текста в \"молодежный жаргон\" по следующему правилу: \n",
    "\n",
    "первая буква каждого слова удаляется и ставится в конец слова; \n",
    "затем в конец слова добавляется слог \"ки\".\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста на русском языке.\"\"\"\n",
    "\n",
    "a = [i for i in input().split()]\n",
    "b = []\n",
    "for i in range(len(a)):\n",
    "    b.append(a[i][1:] + a[i][0] + 'ки')\n",
    "print(*b)"
   ]
  }
 ]
}