{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Python is awesome\n",
    "Напишите программу, которая выводит слова «Python is awesome!» (без кавычек) 10 раз.\"\"\"\n",
    "\n",
    "for i in range(10):\n",
    "    print('Python is awesome!')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Повторяй за мной 1\n",
    "Дано предложение и количество раз которое его надо повторить. Напишите программу, которая повторяет данное предложение нужное количество раз.\n",
    "\n",
    "Формат входных данных\n",
    "В первой строке записано текстовое предложение, во второй — количество повторений.\"\"\"\n",
    "\n",
    "a = input()\n",
    "b = int(input())\n",
    "for i in range(b):\n",
    "    print(a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Последовательность символов\n",
    "Напишите программу, которая использует ровно три цикла for для печати следующей последовательности символов:\n",
    "\n",
    "AAA\n",
    "AAA\n",
    "AAA\n",
    "AAA\n",
    "AAA\n",
    "AAA\n",
    "BBBB\n",
    "BBBB\n",
    "BBBB\n",
    "BBBB\n",
    "BBBB\n",
    "E\n",
    "TTTTT\n",
    "TTTTT\n",
    "TTTTT\n",
    "TTTTT\n",
    "TTTTT\n",
    "TTTTT\n",
    "TTTTT\n",
    "TTTTT\n",
    "TTTTT\n",
    "G\"\"\"\n",
    "\n",
    "for i in range(6):\n",
    "    print('A' * 3)\n",
    "for i in range(5):\n",
    "    print('B' * 4)\n",
    "print('E')\n",
    "for i in range(9):\n",
    "    print('T' * 5)\n",
    "print('G')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Звездный прямоугольник\n",
    "На вход программе подается натуральное число nn.\n",
    "\n",
    "Напишите программу, которая печатает звездный прямоугольник размерами n x 19.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаётся натуральное число n [1;20] — высота звездного прямоугольника.\"\"\"\n",
    "\n",
    "a = int(input())\n",
    "for i in range(a):\n",
    "    print('*' * 19)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Повторяй за мной 2\n",
    "Напишите программу, которая считывает одну строку текста и выводит 10 строк, пронумерованных от 0 до 9, каждая с указанной строкой текста.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка текста.\"\"\"\n",
    "\n",
    "a = input()\n",
    "for i in range(10):\n",
    "    print(i, a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Квадрат числа\n",
    "На вход программе подается натуральное число nn. Напишите программу, которая для каждого из чисел от 00 до nn (включительно) выводит фразу: «Квадрат числа [число] равен [число]» (без кавычек).\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается натуральное число nn.\"\"\"\n",
    "\n",
    "a = int(input())\n",
    "for i in range(a+1):\n",
    "    print('Квадрат числа', i, 'равен', i * i)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Звездный треугольник\n",
    "На вход программе подается натуральное число n , (n≥2) – катет прямоугольного равнобедренного треугольника.\n",
    "\n",
    "Напишите программу, которая выводит звездный треугольник в соответствии с примером.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одно натуральное число n ,(n≥2).\"\"\"\n",
    "\n",
    "a = int(input())\n",
    "for i in range(a):\n",
    "    print('*' * (a - i))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Популяция\n",
    "На вход программе подается три натуральных числа m, p,n:\n",
    "\n",
    "m: стартовое количество организмов;\n",
    "p: среднесуточное увеличение в %;\n",
    "n: количество дней для размножения.\n",
    "Напишите программу, которая предсказывает размер популяции организмов. Программа должна выводить размер популяции в каждый день, начиная с 11 и заканчивая nn-м днем.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается три натуральных числа.\"\"\"\n",
    "\n",
    "m, p, n = int(input()), int(input()), int(input())\n",
    "for i in range(n):\n",
    "    print(i + 1, m)\n",
    "    m += (m * p/100)"
   ]
  }
 ]
}