{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Количество чисел\n",
    "На вход программе подаются два целых числа a и b (a≤b). Напишите программу, которая подсчитывает количество чисел в диапазоне от aa до bb включительно, куб которых оканчивается на 44 или 99.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются два целых числа a и b (a≤b).\"\"\"\n",
    "\n",
    "a, b= int(input()), int(input())\n",
    "count = 0\n",
    "for i in range(a, b+1):\n",
    "    if i ** 3 % 10 == 4 or i ** 3 % 10 == 9:\n",
    "        count += 1\n",
    "print(count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Сумма чисел\n",
    "На вход программе подается натуральное число n, а затем n целых чисел, каждое на отдельной строке. Напишите программу, которая подсчитывает сумму введенных чисел. \n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке.\"\"\"\n",
    "\n",
    "n = int(input())\n",
    "sum = 0\n",
    "for i in range(n):\n",
    "    num = int(input())\n",
    "    sum += num\n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Асимптотическое приближение\n",
    "На вход программе подается натуральное число nn. Напишите программу, которая вычисляет значение выражения\n",
    "(1 + 1/2 + 1/3 + ... + 1/n)−ln(n).\"\"\"\n",
    "\n",
    "from math import * \n",
    "\n",
    "n = int(input())\n",
    "sum = 0\n",
    "for i in range(1, n + 1):\n",
    "    sum += 1/i   \n",
    "print(sum - log(n))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Сумма чисел\n",
    "На вход программе подается натуральное число n. Напишите программу, которая подсчитывает сумму тех чисел от 1 до n (включительно) квадрат которых оканчивается на 2,5 или 8.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается натуральное число n.\"\"\"\n",
    "\n",
    "from math import * \n",
    "\n",
    "n = int(input())\n",
    "sum = 0\n",
    "for i in range(1, n + 1):\n",
    "    if i * i % 10 == 2 or i * i % 10 == 5 or i * i % 10 == 8:\n",
    "        sum += i \n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Факториал\n",
    "На вход программе подается натуральное число n. Напишите программу, которая вычисляет n!.\n",
    "\n",
    "Входные данные\n",
    "На вход программе подается натуральное число n,(n ≤ 12).\"\"\"\n",
    "\n",
    "from math import * \n",
    "\n",
    "n = int(input())\n",
    "sum = 1\n",
    "for i in range(1, n + 1):\n",
    "    sum *= i \n",
    "print(sum)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Без нулей\n",
    "Напишите программу, которая считывает 10 чисел и выводит произведение отличных от нуля чисел.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются 10 целых чисел, каждое на отдельной строке.\"\"\"\n",
    "\n",
    "from math import * \n",
    "\n",
    "sum = 1\n",
    "for i in range(10):\n",
    "    a = int(input())\n",
    "    if a != 0:\n",
    "        sum *= a \n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Сумма делителей\n",
    "На вход программе подается натуральное число n. Напишите программу, которая вычисляет сумму всех его делителей.\n",
    "\n",
    "Входные данные\n",
    "На вход программе подается натуральное число n.\"\"\"\n",
    "\n",
    "from math import * \n",
    "\n",
    "sum = 0\n",
    "n = int(input())\n",
    "for i in range(1, n+1):\n",
    "    if n % i == 0:\n",
    "        sum += i \n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Знакочередующаяся сумма\n",
    "На вход программе подается натуральное число n. Напишите программу вычисления знакочередующей суммы \n",
    "1-2+3-4+5-6 + ...+ (-1)^{n+1}*n.\n",
    "\n",
    "\n",
    "Входные данные\n",
    "На вход программе подается натуральное число nn.\"\"\"\n",
    "\n",
    "sum = 0\n",
    "n = int(input())\n",
    "for i in range(1, n+1):\n",
    "    if i % 2 == 1:\n",
    "        sum += i \n",
    "    else:\n",
    "        sum -= i \n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Наибольшие числа 🌶️🌶️\n",
    "На вход программе подается натуральное число n, а затем n различных натуральных чисел, каждое на отдельной строке. Напишите программу, которая выводит наибольшее и второе наибольшее число последовательности.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются натуральное число n ≥ 2, а затем n различных натуральных чисел, каждое на отдельной строке.\"\"\"\n",
    "\n",
    "num1 = 0\n",
    "num2 = 0\n",
    "n = int(input())\n",
    "for i in range(n):\n",
    "    a = int(input())\n",
    "    if a > num1:\n",
    "        num2 = num1\n",
    "        num1 = a\n",
    "    else:\n",
    "        if a > num2:\n",
    "            num2 = a\n",
    "print(num1, num2, sep='\\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Only even numbers 🌶️\n",
    "Напишите программу, которая считывает последовательность из 10 целых чисел и определяет является ли каждое из них четным или нет.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются 10 целых чисел, каждое на отдельной строке.\"\"\"\n",
    "\n",
    "count = 0\n",
    "for i in range(10):\n",
    "    n = int(input())\n",
    "    if n % 2 == 0:\n",
    "        count += 1\n",
    "if count == 10:\n",
    "    print('YES')\n",
    "else:\n",
    "    print('NO')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Последовательность Фибоначчи 🌶️\n",
    "Напишите программу, которая считывает натуральное число n и выводит первые n чисел последовательности Фибоначчи.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одно число n – количество членов последовательности.\"\"\"\n",
    "\n",
    "n = int(input())\n",
    "a, b, c = 0, 0, 1\n",
    "for i in range(n):\n",
    "    if n ==0 :\n",
    "        print(n)\n",
    "    else:\n",
    "        a = b\n",
    "        b = c\n",
    "        print(c, end = ' ')\n",
    "        c = a + b"
   ]
  }
 ]
}