{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"До КОНЦА 1\n",
    "На вход программе подается последовательность слов, каждое слово на отдельной строке. Концом последовательности является слово «КОНЕЦ» (без кавычек). Напишите программу, которая выводит члены данной последовательности.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается последовательность слов, каждое слово на отдельной строке.\"\"\"\n",
    "\n",
    "a = input()\n",
    "while a != 'КОНЕЦ':\n",
    "    print(a)\n",
    "    a = input()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"До КОНЦА 2\n",
    "На вход программе подается последовательность слов, каждое слово на отдельной строке. Концом последовательности является слово «КОНЕЦ» или «конец» (большими или маленькими буквами, без кавычек). Напишите программу, которая выводит члены данной последовательности.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается последовательность слов, каждое слово на отдельной строке.\"\"\"\n",
    "\n",
    "a = input()\n",
    "while a != 'КОНЕЦ' and a != 'конец':\n",
    "    print(a)\n",
    "    a = input()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Количество членов\n",
    "На вход программе подается последовательность слов, каждое слово на отдельной строке. Концом последовательности является одно из трех слов: «стоп», «хватит», «достаточно» (маленькими буквами, без кавычек). Напишите программу, которая выводит общее количество членов данной последовательности.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается последовательность слов, каждое слово на отдельной строке.\"\"\"\n",
    "\n",
    "a = input()\n",
    "count = 0\n",
    "while a != 'стоп' and a != 'хватит' and a != 'достаточно':\n",
    "    count +=1\n",
    "    a = input()\n",
    "print(count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Пока делимся\n",
    "На вход программе подается последовательность целых чисел делящихся на 77, каждое число на отдельной строке. Концом последовательности является любое число не делящееся на 77. Напишите программу, которая выводит члены данной последовательности.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается последовательность чисел, каждое число на отдельной строке.\"\"\"\n",
    "\n",
    "a = int(input())\n",
    "count = 0\n",
    "while a % 7 == 0:\n",
    "    print(a)\n",
    "    a = int(input())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Сумма чисел\n",
    "На вход программе подается последовательность целых чисел, каждое число на отдельной строке. Концом последовательности является любое отрицательное число. Напишите программу, которая выводит сумму всех членов данной последовательности.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается последовательность чисел, каждое число на отдельной строке.\"\"\"\n",
    "\n",
    "a = int(input())\n",
    "sum = 0\n",
    "while a > 0:\n",
    "    sum += a\n",
    "    a = int(input())\n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Количество пятерок\n",
    "На вход программе подается последовательность целых чисел от 1 до 5, характеризующее оценку ученика, каждое число на отдельной строке. Концом последовательности является любое отрицательное число, либо число большее 5. Напишите программу, которая выводит количество пятерок.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается последовательность чисел, каждое число на отдельной строке.\"\"\"\n",
    "\n",
    "count = 0\n",
    "a = int(input())\n",
    "while 0 < a <= 5:\n",
    "    if a == 5: \n",
    "        count+= 1\n",
    "    a = int(input())\n",
    "print(count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Ведьмаку заплатите чеканной монетой\n",
    "Всем известно, что ведьмак способен одолеть любых чудовищ, однако его услуги обойдутся недешево, к тому же ведьмак не принимает купюры, он принимает только чеканные монеты. В мире ведьмака существуют монеты с номиналами 1, 5, 10, 25.\n",
    "\n",
    "Напишите программу, которая определяет какое минимальное количество чеканных монет нужно заплатить ведьмаку.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается одно натуральное число, цена за услугу ведьмака.\"\"\"\n",
    "\n",
    "count = 0\n",
    "a = int(input())\n",
    "while a != 0:\n",
    "    while a >= 25:\n",
    "        count +=1\n",
    "        a -=25\n",
    "    while a >= 10:\n",
    "        count +=1\n",
    "        a -= 10\n",
    "    while a >= 5:\n",
    "        count +=1\n",
    "        a -= 5\n",
    "    while a >= 1:\n",
    "        count +=1\n",
    "        a -= 1\n",
    "print(count)"
   ]
  }
 ]
}