{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Дополните приведенный код, используя индексатор, так чтобы он вывел символ запятой.\"\"\"\n",
    "\n",
    "s = \"In 2010, someone paid 10k Bitcoin for two pizzas.\"\n",
    "\n",
    "print(s[7])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"В столбик 1\n",
    "На вход программе подается одна строка. Напишите программу, которая выводит элементы строки с индексами 0, 2, 4, ... в столбик.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка.\"\"\"\n",
    "\n",
    "string = input()\n",
    "for i in range(0, len(string), 2):\n",
    "    print(string[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"В столбик 2\n",
    "На вход программе подается одна строка. Напишите программу, которая выводит в столбик элементы строки в обратном порядке.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка.\"\"\"\n",
    "\n",
    "string = input()\n",
    "for i in range(len(string)-1, 0-1, -1):\n",
    "    print(string[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"ФИО\n",
    "На вход программе подаются три строки: имя, фамилия и отчество. Напишите программу, которая выводит инициалы человека.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются три строки, каждая на отдельной строке.\"\"\"\n",
    "\n",
    "a, b, c = input(), input(), input()\n",
    "print(b[0] + a[0] + c[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Цифра 1\n",
    "На вход программе подается одна строка состоящая из цифр. Напишите программу, которая считает сумму цифр данной строки.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка состоящая из цифр.\"\"\"\n",
    "\n",
    "number = int(input())\n",
    "sum = 0\n",
    "while number > 0:\n",
    "    sum += number % 10\n",
    "    number = number // 10\n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Цифра 2\n",
    "На вход программе подается одна строка. Напишите программу, которая выводит сообщение «Цифра» (без кавычек), если строка содержит цифру. В противном случае вывести сообщение «Цифр нет» (без кавычек).\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка.\"\"\"\n",
    "\n",
    "number = input()\n",
    "a= 0\n",
    "for i in number:\n",
    "    if i.isdigit() == True:\n",
    "        a = 1\n",
    "if a == 1:\n",
    "    print('Цифра')\n",
    "else:\n",
    "    print('Цифр нет')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Сколько раз?\n",
    "На вход программе подается одна строка. Напишите программу, которая определяет сколько раз в строке встречаются символы + и *.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка.\"\"\"\n",
    "\n",
    "a = input()\n",
    "sumstars = 0\n",
    "sumplus = 0\n",
    "for i in a:\n",
    "    if i == '+':\n",
    "        sumplus +=1\n",
    "    elif i == '*':\n",
    "        sumstars += 1\n",
    "print('Символ + встречается', sumplus, 'раз')\n",
    "print('Символ * встречается', sumstars, 'раз')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Одинаковые соседи\n",
    "На вход программе подается одна строка. Напишите программу, которая определяет сколько в ней одинаковых соседних символов.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Гласные и согласные\n",
    "На вход программе подается одна строка с буквами русского языка. Напишите программу, которая определяет количество гласных и согласных букв.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка.\"\"\"\n",
    "\n",
    "a = input().lower()\n",
    "glas = 0\n",
    "soglas = 0\n",
    "for i in a:\n",
    "    if i in 'ауоыиэяюёе':\n",
    "        glas +=1\n",
    "    elif i in 'бвгджзйклмнпрстфхцчшщ':\n",
    "        soglas += 1\n",
    "print('Количество гласных букв равно', glas)\n",
    "print('Количество согласных букв равно', soglas)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Decimal to Binary\n",
    "На вход программе подается натуральное число, записанное в десятичной системе счисления. Напишите программу, которая переводит данное число в двоичную систему счисления.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одно натуральное число строка.\"\"\"\n",
    "\n",
    "number = int(input())\n",
    "sum = ''\n",
    "while number >0:\n",
    "    sum += str(number % 2)\n",
    "    number = number // 2\n",
    "sum = sum[::-1]\n",
    "print(sum)"
   ]
  }
 ]
}