{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Количество слов\n",
    "На вход программе подается строка текста, состоящая из слов, разделенных ровно одним пробелом. Напишите программу, которая подсчитывает количество слов в ней.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается строка текста.\"\"\"\n",
    "\n",
    "s = input()\n",
    "print(s.count(' ') + 1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Минутка генетики\n",
    "На вход программе подается строка генетического кода, состоящая из букв А (аденин), Г (гуанин), Ц (цитозин), Т (тимин). Напишите программу, которая подсчитывает сколько аденина, гуанина, цитозина и тимина входит в данную строку генетического кода.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается строка генетического кода, состоящая из символов А, Г, Ц, Т, а, г, ц, т.\"\"\"\n",
    "\n",
    "s = input().lower()\n",
    "print('Аденин:', s.count('а'))\n",
    "print('Гуанин:', s.count('г'))\n",
    "print('Цитозин:', s.count('ц'))\n",
    "print('Тимин:', s.count('т'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Очень странные дела\n",
    "Джим Хоппер с помощью радиоприемника пытается получить сообщение Оди. На приемник ему поступает nn различных последовательностей кода Морзе. Декодировав их, он получает последовательности из цифр и строчного латинского алфавита, при этом во всех сообщениях Оди содержится число 11, причем минимум 3 раза. Помогите определить Джиму количество сообщений от Оди.\n",
    "\n",
    "Формат входных данных\n",
    "В первой строке подаётся число n – количество сообщений, в последующих n строках вводятся строки, содержащие латинские строчные буквы и цифры.\"\"\"\n",
    "\n",
    "num = int(input())\n",
    "cnt = 0\n",
    "for i in range(0, num):\n",
    "    s = input()\n",
    "    if s.count('11') > 2:\n",
    "        cnt +=1\n",
    "print(cnt)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Количество цифр\n",
    "На вход программе подается строка текста. Напишите программу, которая подсчитывает количество цифр в данной строке.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается строка текста.\"\"\"\n",
    "\n",
    "s = input()\n",
    "cnt = 0\n",
    "for i in s:\n",
    "    if i in '1234567890':\n",
    "        cnt +=1\n",
    "print(cnt)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\".com or .ru\n",
    "На вход программе подается строка текста. Напишите программу, которая проверяет, что строка заканчивается подстрокой .com или .ru.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается строка текста.\"\"\"\n",
    "\n",
    "s = input()\n",
    "if s.endswith('.com') == True or s.endswith('.ru') == True:\n",
    "    print('YES')\n",
    "else:\n",
    "    print('NO')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Самый частотный символ\n",
    "На вход программе подается строка текста. Напишите программу, которая выводит на экран символ, который появляется наиболее часто.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается строка текста. Текст может содержать строчные и заглавные буквы английского и русского алфавита, а также цифры.\"\"\"\n",
    "\n",
    "s = input()\n",
    "max = 0\n",
    "maxs = ''\n",
    "for i in s:\n",
    "    if s.count(i) >= max:\n",
    "        max = s.count(i)\n",
    "        maxs = i\n",
    "print(maxs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Первое и последнее вхождение\n",
    "На вход программе подается строка текста. Если в этой строке буква «f» встречается только один раз, выведите её индекс. Если она встречается два и более раз, выведите индекс её первого и последнего вхождения на одной строке, разделенных символом пробела. Если буква «f» в данной строке не встречается, следует вывести «NO».\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается строка текста.\"\"\"\n",
    "\n",
    "s = input()\n",
    "if s.count('f') == 0:\n",
    "    print('NO')\n",
    "elif s.count('f') == 1:\n",
    "    print(s.find('f'))\n",
    "elif s.count('f') >= 2:\n",
    "    print(s.find('f'), s.rfind('f'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Удаление фрагмента\n",
    "На вход программе подается строка текста, в которой буква «h» встречается минимум два раза. Напишите программу, которая удаляет из этой строки первое и последнее вхождение буквы «h», а также все символы, находящиеся между ними.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается строка текста.\"\"\"\n",
    "\n",
    "s = input()\n",
    "first = s.find('h')\n",
    "last = s.rfind('h')\n",
    "print(s[0:first] + s[last+1:])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Дополните приведенный код, используя форматирование строк с помощью метода format, так чтобы он вывел текст: \n",
    "\n",
    "«In 2010, someone paid 10k Bitcoin for two pizzas.» (без кавычек).\"\"\"\n",
    "\n",
    "s = 'In {0}, someone paid {1} {2} for two pizzas.'.format('2010', '10k', 'Bitcoin')\n",
    "\n",
    "print(s)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Дополните приведенный код, используя форматирование строк с помощью f-строк, так чтобы он вывел текст: \n",
    "\n",
    "«In 2010, someone paid 10K Bitcoin for two pizzas.» (без кавычек).\"\"\"\n",
    "\n",
    "year = 2010\n",
    "amount = '10K'\n",
    "currency = 'Bitcoin'\n",
    "\n",
    "print(f'In {year}, someone paid {amount} {currency} for two pizzas.')"
   ]
  }
 ]
}