{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Символы в диапазоне\n",
    "На вход программе подаются два числа a и b. Напишите программу, которая для каждого кодового значения в диапазоне от a до b (включительно), выводит соответствующий ему символ из таблицы символов Unicode.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается два натуральных числа, каждое на отдельное строке.\"\"\"\n",
    "\n",
    "a = int(input())\n",
    "b = int(input())\n",
    "for i in range(a, b+1):\n",
    "    print(chr(i), end = ' ')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Простой шифр\n",
    "На вход программе подается строка текста. Напишите программу, которая переводит каждый ее символ в соответствующий ему код из таблицы символов Unicode.\n",
    "\n",
    "Формат входных данных \n",
    "На вход программе подается строка текста.\"\"\"\n",
    "\n",
    "a = input()\n",
    "for i in a:\n",
    "    print(ord(i), end = ' ')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Шифр Цезаря 🌶️\n",
    "Легион Цезаря, созданный в 23 веке на основе Римской Империи не изменяет древним традициям и использует шифр Цезаря. Это их и подвело, ведь данный шифр очень простой. Однако в постапокалипсисе люди плохо знают все тонкости довоенного мира, поэтому ученые из НКР не могут понять как именно нужно декодировать данные сообщения. Напишите программу для декодирования этого шифра.\n",
    "\n",
    "Формат входных данных\n",
    "В первой строке дается число n (1≤ n≤ 25) – сдвиг, во второй строке даётся закодированное сообщение в виде строки со строчными латинскими буквами.\"\"\"\n",
    "\n",
    "b = int(input())\n",
    "a = input()\n",
    "for i in a:\n",
    "    if ord(i)-b < 97:\n",
    "        print(chr(123 - (97 - (ord(i)-b))), end = '')\n",
    "    else:\n",
    "        print(chr(ord(i)-b), end = '')"
   ]
  }
 ]
}